In [1]:
import pandas as pd
import numpy as np

# 1. Creating a Dataframe from an array

# 1.1 Option 1

In [2]:
# creating an array
data = np.array([[1, 4], [2, 5], [3, 6]])

In [3]:
data

array([[1, 4],
       [2, 5],
       [3, 6]])

In [4]:
# creating a dataframe
df = pd.DataFrame(data, index = ["row1", "row2", "row3"], columns = ["col1", "col2"])

In [5]:
# displayind the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 1.2 Option 2

In [6]:
# creating an array with a list shape
data = ([[1, 4], [2, 5], [3, 6]])

In [7]:
# creating the dataframe
df = pd.DataFrame(data, index = ["row1", "row2", "row3"], columns = ["col1", "col2"])

In [8]:
# showing the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 2. Creating a Dataframe from a Dictionary

In [9]:
# lists used for this example
states = ["California", "Texas", "Florida", "New york", "Michigan"]
population = [39613493, 29730311, 21944577, 19299981, 23678901]

In [10]:
# Storing list within a dictionary
dict_states = {
    "states" : states,
    "population" : population
}

In [11]:
dict_states.keys()

dict_keys(['states', 'population'])

In [12]:
dict_states.values()

dict_values([['California', 'Texas', 'Florida', 'New york', 'Michigan'], [39613493, 29730311, 21944577, 19299981, 23678901]])

In [13]:
dict_states.items()

dict_items([('states', ['California', 'Texas', 'Florida', 'New york', 'Michigan']), ('population', [39613493, 29730311, 21944577, 19299981, 23678901])])

In [14]:
# Creating the dataframe
df_population = pd.DataFrame(dict_states)

In [15]:
# Shwoing the dataframe
df_population

       states  population
0  California    39613493
1       Texas    29730311
2     Florida    21944577
3    New york    19299981
4    Michigan    23678901

# 3. Creating a DataFrame from a csv file

In [16]:
# reading the csv file
df_exam = pd.read_csv("../Dataset/StudentsPerformance.csv")

In [17]:
# show first five row in the dataframe
df_exam.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [18]:
# show all the rows in the dataframe
df_exam

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86